In [1]:
import pandas as pd
import numpy as np

In [2]:
import sqlite3
con = sqlite3.connect("phonepe.db")
mycursor = con.cursor()

In [3]:
AGG_TRANS = pd.read_csv("AGGREGATED_TRANS.csv")
AGG_TRANS.head(1)

,State,Year,Quater,Transaction_type,Transaction_count,Transaction_amt
0,manipur,2020,2,Peer-to-peer payments,533206,2.980243e+09

In [4]:
mycursor.execute('''CREATE TABLE IF NOT EXISTS AGGREGATED_TRANSACTION(
                  State VARCHAR(200),
                  Year INT,
                  Quater INT,
                  Transaction_type VARCHAR(200),
                  Transaction_count INT,
                  Transaction_amt DOUBLE)''')
con.commit()

In [5]:
for row in AGG_TRANS.itertuples():
    query = '''insert into AGGREGATED_TRANSACTION(State,Year,Quater,Transaction_type,Transaction_count,Transaction_amt) 
                                                   values(?,?,?,?,?,?)'''
    Values = (row.State,row.Year,row.Quater,row.Transaction_type,row.Transaction_count,row.Transaction_amt)
    mycursor.execute(query,Values)
con.commit()

In [6]:
AGG_user=pd.read_csv("AGGREGATED_USER.csv")
AGG_user.head(1)

     State  Year  Quater Brand_name  UserCount  UserPercentage
0  manipur  2020       2     Xiaomi     101637        0.471642

In [7]:
mycursor.execute('''CREATE TABLE IF NOT EXISTS AGGREGATED_USER(
                    State VARCHAR(200),
                    Year INT,
                    Quater INT,
                    Brand_name	VARCHAR(200),
                    UserCount INT,
                    UserPercentage INT)''')
con.commit()

In [8]:
for row in AGG_user.itertuples():
    query = '''insert into AGGREGATED_USER(State,Year,Quater,Brand_name,UserCount,UserPercentage) 
                                                   values(?,?,?,?,?,?)'''
    Values = (row.State,row.Year,row.Quater,row.Brand_name,row.UserCount,row.UserPercentage)
    mycursor.execute(query,Values)
con.commit()

In [9]:
Map_trans =pd.read_csv("Map_Trans.csv")
Map_trans.head(1)

     State  Year  Quater  metric_amount  metric_count         metric_type
0  manipur  2020       2   1.050349e+08         48617  kangpokpi district

In [10]:
mycursor.execute('''CREATE TABLE IF NOT EXISTS MAP_TRANSACTION(
                  State VARCHAR(200),
                  Year INT,
                  Quater INT,
                  metric_amount DOUBLE,
                  metric_count INT,
                  metric_type VARCHAR(200))''')
con.commit()

In [11]:
for row in Map_trans.itertuples():
    query = '''insert into MAP_TRANSACTION(State,Year,Quater,metric_amount,metric_count, metric_type) 
                                                   values(?,?,?,?,?,?)'''
    Values = (row.State,row.Year,row.Quater,row.metric_amount,row.metric_count,row.metric_type)
    mycursor.execute(query,Values)
con.commit()

In [12]:
MAP_user =pd.read_csv("Map_User.csv")
MAP_user .head(1)

     State  Year  Quater  RegisteredUsers           DISTRICTS
0  manipur  2020       2            12965  kangpokpi district

In [13]:
mycursor.execute('''CREATE TABLE IF NOT EXISTS MAP_USER(
                  State VARCHAR(200),
                  Year INT,
                  Quater INT,
                  RegisteredUsers INT,
                  DISTRICTS VARCHAR(200))''')
con.commit()

In [14]:
for row in MAP_user.itertuples():
    query = '''insert into MAP_USER(State,Year,Quater,RegisteredUsers,DISTRICTS) 
                                                   values(?,?,?,?,?)'''
    Values = (row.State,row.Year,row.Quater,row.RegisteredUsers,row.DISTRICTS)
    mycursor.execute(query,Values)
con.commit()

In [15]:
TOP_TRANS_DIS=pd.read_csv("Top_Trans_Districts.csv")
TOP_TRANS_DIS.head(1)

     State  Year  Quater   EntityName  metric_amount  metric_count
0  manipur  2020       2  imphal west   2.034862e+09        551775

In [16]:
mycursor.execute('''CREATE TABLE IF NOT EXISTS TOP_TRANSACTION_DISTRICTS(
                  State VARCHAR(200),
                  Year INT,
                  Quater INT,
                  EntityName VARCHAR(200),
                  metric_amount DOUBLE,
                  metric_count INT)''')
con.commit()

In [17]:
for row in TOP_TRANS_DIS.itertuples():
    query = '''insert into TOP_TRANSACTION_DISTRICTS(State,Year,Quater,EntityName,metric_amount, metric_count) 
                                                   values(?,?,?,?,?,?)'''
    Values = (row.State,row.Year,row.Quater,row.EntityName,row.metric_amount,row.metric_count)
    mycursor.execute(query,Values)
con.commit()

In [18]:
TOP_trans_pin =  pd.read_csv("Top_Trans_pincode.csv")
TOP_trans_pin.head(1)

     State  Year  Quater  Entity_Name  Metric_Amount  Metric_Count
0  manipur  2020       2     795004.0   1.785186e+09        434372

In [19]:
mycursor.execute('''CREATE TABLE IF NOT EXISTS TOP_TRANSACTION_PINCODE(
                  State	VARCHAR(200),
                  Year INT,
                  Quater INT,
                  Entity_Name INT,
                  Metric_Amount DOUBLE,
                  Metric_Count INT)''')
con.commit()

In [20]:
for row in TOP_trans_pin.itertuples():
    query = '''insert into TOP_TRANSACTION_PINCODE(State,Year,Quater,Entity_Name,Metric_Amount,Metric_Count) 
                                                   values(?,?,?,?,?,?)'''
    Values = (row.State,row.Year,row.Quater,row.Entity_Name,row.Metric_Amount,row.Metric_Count)
    mycursor.execute(query,Values)
con.commit()

In [21]:
TOP_USER_DIS = pd.read_csv("Top_User_districts.csv")
TOP_USER_DIS.head(1)

     State  Year  Quater  RegisteredUsers    Districts
0  manipur  2020       2            67897  imphal west

In [22]:
mycursor.execute('''CREATE TABLE IF NOT EXISTS TOP_USER_DISTRICTS(
                  State VARCHAR(200),
                  Year INT,
                  Quater INT,
                  RegisteredUsers INT,
                  Districts VARCHAR(200))''')
con.commit()

In [23]:
for row in TOP_USER_DIS.itertuples():
    query = '''insert into TOP_USER_DISTRICTS(State,Year,Quater,RegisteredUsers,Districts) 
                                                   values(?,?,?,?,?)'''
    Values = (row.State,row.Year,row.Quater,row.RegisteredUsers,row.Districts)
    mycursor.execute(query,Values)
con.commit()

In [24]:
TOP_USER_PIN = pd.read_csv("Top_User_pincode.csv")
TOP_USER_PIN.head(1)

     State  Year  Quater  RegisteredUsers  Pincode
0  manipur  2020       2            32442   795004

In [25]:
mycursor.execute('''CREATE TABLE IF NOT EXISTS TOP_USER_PINCODE(
                  State VARCHAR(200),
                  Year INT,
                  Quater INT,
                  RegisteredUsers INT,
                  Pincode INT)''')
con.commit()

In [26]:
for row in TOP_USER_PIN.itertuples():
    query = '''insert into TOP_USER_PINCODE(State,Year,Quater,RegisteredUsers,Pincode) 
                                                   values(?,?,?,?,?)'''
    Values = (row.State,row.Year,row.Quater,row.RegisteredUsers,row.Pincode)
    mycursor.execute(query,Values)
con.commit()

In [4]:
# SQL Query

# Transaction Analysis bar chart query
mycursor.execute(f"SELECT State,Transaction_amt FROM AGGREGATED_TRANSACTION WHERE Year = Year AND Quater = Quater AND Transaction_type = Transaction_type")
AGG_trns_tab = mycursor.fetchall()
df_AGG_trns_tab = pd.DataFrame(np.array(AGG_trns_tab), columns=['State', 'Transaction_amount'])
df_AGG_trns_tab1 = df_AGG_trns_tab.set_index(pd.Index(range(1, len(df_AGG_trns_tab)+1)))

In [5]:
df_AGG_trns_tab1

          State  Transaction_amount
1       manipur   2980242535.075443
2       manipur  107589094.29890464
3       manipur  106540409.29886684
4       manipur  1457570.8004862317
5       manipur   3106603.331810386
...         ...                 ...
4130  jharkhand  12664709652.347084
4131  jharkhand   440323945.0577217
4132  jharkhand  391616776.11217976
4133  jharkhand   47227410.81132864
4134  jharkhand    83358664.9497917

[4134 rows x 2 columns]

In [8]:
# Transaction Analysis table query
mycursor.execute(f"SELECT State,Transaction_count,Transaction_amt FROM AGGREGATED_TRANSACTION WHERE Year = Year AND Quater = Quater AND Transaction_type = Transaction_type")
AGG_trns_tab = mycursor.fetchall()
df_AGG_trns_tab = pd.DataFrame(np.array(AGG_trns_tab), columns=['State','Transaction_count','Transaction_amount'])

In [9]:
df_AGG_trns_tab

          State Transaction_count  Transaction_amount
0       manipur            533206   2980242535.075443
1       manipur            450830  107589094.29890464
2       manipur             92110  106540409.29886684
3       manipur              1676  1457570.8004862317
4       manipur              5246   3106603.331810386
...         ...               ...                 ...
4129  jharkhand           5952105  12664709652.347084
4130  jharkhand           2347079   440323945.0577217
4131  jharkhand            892826  391616776.11217976
4132  jharkhand            105558   47227410.81132864
4133  jharkhand             90140    83358664.9497917

[4134 rows x 3 columns]

In [10]:
# Total Transaction Amount table query
mycursor.execute(f"SELECT SUM(Transaction_amt), AVG(Transaction_amt) FROM AGGREGATED_TRANSACTION WHERE Year = Year AND Quater= Quater AND Transaction_type = Transaction_type")
AGG_trns_tab= mycursor.fetchall()
df_AGG_trns_tab = pd.DataFrame(np.array(AGG_trns_tab), columns=['Total','Average'])
df_AGG_trns_tab1 = df_AGG_trns_tab.set_index(['Average'])

In [11]:
df_AGG_trns_tab1

                     Total
Average
4.568227e+10  1.888505e+14

In [12]:
# Total Transaction Count table query
mycursor.execute(f"SELECT SUM(Transaction_count), AVG(Transaction_count) FROM AGGREGATED_TRANSACTION WHERE Year = Year AND Quater = Quater AND Transaction_type = Transaction_type")
AGG_trns_tab= mycursor.fetchall()
df_AGG_trns_tab = pd.DataFrame(np.array(AGG_trns_tab), columns=['Total','Average'])
df_AGG_trns_tab1 = df_AGG_trns_tab.set_index(['Average'])

In [13]:
df_AGG_trns_tab1

                     Total
Average
2.829355e+07  1.169655e+11